{
	"theme_color": "#46BDC8",
	"title": "Estu Application",
	"subtitle": "How we designed and developed a centralized all in one platform to streamline students' academic, financial, and social activities, resulting in a seamless user experience and improved management for both students and brands.",
	"hero_img": "estu/Hero_Image_1.webp",
	"about": {
		"name": "Estu Application",
		"desc": "Estu is a comprehensive platform designed to streamline and centralize student life by providing tools for managing academics, finances, social interactions, and events all in one place. ",
		"domain": "Educational Tech (Student Life Management)",
		"year": "2024",
		"services": ["Research", "UI & UX Designing"],
		"platform": "Web, Mobile",
		"mainTechStack": ["Figma"],
		"images": [
			{
				"img": "estu/About_Image_1.webp",
				"alt": "Estu Application Overview",
				"width": 1224,
				"height": 434
			}
		]
	},
	"projectTeam": {
		"desc": "",
		"members": ["UI/UX Designer - Feejan"],
		"img": "placeholder.png"
	},
	"projectDetails_1": [
		{
			"heading": "What was the Problem?",
			"desc": "<ul><li>College students engage in multiple activities and need to use different apps for managing social connections, academics, and finances.</li><li>This constant switching between apps creates unnecessary complexity.</li><li>The client aimed to develop an application that centralizes all these activities into one platform, visually aligning with students' needs and simplifying their daily tasks.</li></ul>"
		},
		{
			"heading": "What were the Goals?",
			"desc": "<ul><li>To design and develop an application with multiple features that helps students manage their academic, financial, social, and event-related activities.</li><li>To create a landing page that effectively communicates the app’s features and benefits.</li><li>To build a platform to help partners bring exclusive deals and discounts to students.</li><li>To create a platform for administrators to manage partners, students, and other stakeholders efficiently.</li><li>To keep a modern look for all components, making sure they align with the target audience and Estu’s branding.</li></ul>"
		},
		{
			"heading": "What was the Solution?",
			"desc": "<ul><li><strong>Estu Application:</strong> A comprehensive platform that simplifies student life with features like payments, ACH transfers, Estu debit card, part to part payments, academic calendar, discounts, events, social feed, and more.</li><li><strong>Estu Landing Page:</strong> A clear, engaging web page to introduce Estu’s features and guide students through the app’s offerings.</li><li><strong>Estu-Ads Platform:</strong> A space for partners to showcase deals and promotions for students, enhancing the app’s value proposition.</li><li><strong>Estu-Admin Platform:</strong> A management tool for admins to oversee user accounts, partners, and various platform stakeholders, ensuring smooth operation</li></ul>"
		}
	],
	"mockups_1": [
		{
			"img": "estu/Solution_1.webp",
			"alt": "Estu Application Mockup 1",
			"width": 590,
			"height": 434
		},
		{
			"img": "estu/Solution_3.webp",
			"alt": "Estu Application Mockup 2",
			"width": 590,
			"height": 434
		},
		{
			"img": "estu/Solution_2.webp",
			"alt": "Estu Application Mockup 3",
			"width": 590,
			"height": 434
		},
		{
			"img": "estu/Solution_4.webp",
			"alt": "Estu Application Mockup 4",
			"width": 590,
			"height": 434
		}
	],
	"projectDetails_2": [
		{
			"heading": "Behind the Scenes...",
			"desc": "<div><span className='inner_title'>Target Audience</span><br /><br /><ul><li>US college students, aged 18–24, who are tech-savvy, budget-conscious, and socially active.</li></ul></div><br /><div><span className='inner_title'>Understanding the Problem</span><br /><br /><p>We started by analyzing the main problem and brainstorming the necessary features. We then decided which features to focus on first based on client feedback, the existing application, and inspiration. We tackled the features one by one, breaking the app into manageable sections.</p></div><br /><div><span className='inner_title'>Iterative Design Process</span><br /><br /><p>We took an approach of working on the app feature by feature. This involved wireframing to understand how each feature would flow and display data. Multiple iterations were made, and based on feedback from both our internal team and the client, the final design was confirmed.</p></div><br /><div><span className='inner_title'>Building the Ecosystem</span><br /><br /><ul><li>The app features ACH transfers, Estu debit card, P2P payments, academic calendar, discounts, events, social feed, and more.</li><li>An ecosystem was created to manage stakeholders, with the Estu Ads platform for brands to offer deals, an admin platform to manage students and brands, and a landing page to explain the app’s features to students.</li><li>In addition, a web version of the Events and Ads pages was developed to assist brands in managing their promotions.</li></ul></div>"
		},
		{
			"heading": "User Interface and Product Outlook",
			"desc": "A clean and modern design featuring cyan as the primary color, which conveys freshness and energy, perfectly complementing the Gen Z target audience. Paired with professional, sleek typography using the 'Manrope' font, the design creates a minimal and contemporary look throughout the entire ecosystem."
		}
	],
	"mockups_2": [
		{
			"img": "estu/User_Interface_and_Product_Outlook_1.webp",
			"alt": "User Interface Mockup 1",
			"width": 496,
			"height": 264
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_2.webp",
			"alt": "User Interface Mockup 2",
			"width": 288,
			"height": 264
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_3.webp",
			"alt": "User Interface Mockup 3",
			"width": 400,
			"height": 400
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_4.webp",
			"alt": "User Interface Mockup 4",
			"width": 552,
			"height": 400
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_5.webp",
			"alt": "User Interface Mockup 5",
			"width": 400,
			"height": 260
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_6.webp",
			"alt": "User Interface Mockup 6",
			"width": 400,
			"height": 270
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_7.webp",
			"alt": "User Interface Mockup 7",
			"width": 400,
			"height": 400
		}
	],
	"mockups_3": [
		{
			"img": "estu/User_Interface_and_Product_Outlook_8.webp",
			"alt": "User Interface Mockup 8",
			"width": 496,
			"height": 264
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_9.webp",
			"alt": "User Interface Mockup 9",
			"width": 288,
			"height": 264
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_10.webp",
			"alt": "User Interface Mockup 10",
			"width": 288,
			"height": 264
		},
		{
			"img": "estu/User_Interface_and_Product_Outlook_11.webp",
			"alt": "User Interface Mockup 11",
			"width": 288,
			"height": 264
		}
	],
	"projectDetails_3": [
		{
			"heading": "Conclusion",
			"desc": "<div className='inner_title'>What did we achieve from the project ?</div><br/><ul><li><strong>Centralized Solution:</strong> We created an app that streamlines students' academic, financial, social, and event-related activities into one platform.</li><li><strong>Key Features Implementation:</strong> Successfully integrated essential features like , Estu debit card, academic calendar, discounts, ACH transfers, P2P payments and social feeds.</li><li><strong>Effective Stakeholder Management:</strong> Designed and developed the Estu-Ads platform for brands to offer deals and the Estu-Admin platform to manage students, brands, and other stakeholders.</li><li><strong>User-Centric Design:</strong> Delivered a modern, visually appealing design resonating with the Gen Z audience.</li></ul>"
		}
	]
}
